# Usage:
#
#   brew tap homebrew/bundle
#   brew bundle

# Taps
tap "argon/mas"
tap "heroku/brew"
tap "homebrew/services"
tap "itspriddle/brews"
tap "puma/homebrew-puma"
tap "sj26/git-buildkite"
tap "universal-ctags/universal-ctags"

# Casks
cask "docker"

# Ruby/Rails apps
brew "awscli"
brew "chruby"
brew "dwdiff"
brew "imagemagick"
brew "mailhog"
brew "puma-dev"
brew "redis"
brew "ruby-install"

# PHP
brew "composer"
brew "wp-cli"

# Databases
brew "mysql@5.6"
brew "postgresql@9.6"
brew "sqlite"

# SAAS
brew "git-buildkite"
brew "heroku"

# Utilities
brew "argon/mas/mas"
brew "bats"
brew "chromedriver"
brew "direnv"
brew "exiftool"
brew "fzf"
brew "gist"
brew "git"
brew "git-lfs"
brew "gnupg2"
brew "hub"
brew "itspriddle/brews/imgur-bash"
brew "itspriddle/brews/vim"
brew "jq"
brew 'pinentry-mac'
brew "pv"
brew "ripgrep"
brew "rename"
brew "shellcheck"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tree"
brew "universal-ctags", args: ["HEAD"]
brew "vnstat"
brew "wget"
brew "youtube-dl"

# Mac App Store apps
mas "1Password",         id: 443987910
mas "Affinity Designer", id: 824171161
mas "Affinity Photo",    id: 824183456
mas "Amphetamine",       id: 937984704
mas "Deliveries",        id: 924726344
mas "Magnet",            id: 441258766
mas "Marked 2",          id: 890031187
mas "Numbers",           id: 409203825
mas "Pages",             id: 409201541
mas "Pixelmator",        id: 407963104
mas "Slack",             id: 803453959
mas "The Unarchiver",    id: 425424353
mas "Tweetbot",          id: 557168941
mas "iA Writer",         id: 775737590
